#### Terraform Format and Style 🖌 `failure` (ignored)
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.github.data.github_branch.locky_master will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "locky_master"  {
      + branch     = "master"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "locky"
      + sha        = (known after apply)
    }

  # module.github.data.github_branch.terraform_jda_master will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "terraform_jda_master"  {
      + branch     = "master"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "terraform_jda"
      + sha        = (known after apply)
    }

  # module.github.github_branch_default.locky will be created
  + resource "github_branch_default" "locky" {
      + branch     = "master"
      + id         = (known after apply)
      + repository = "locky"
    }

  # module.github.github_branch_default.terraform_jda will be created
  + resource "github_branch_default" "terraform_jda" {
      + branch     = "master"
      + id         = (known after apply)
      + repository = "terraform_jda"
    }

  # module.github.github_repository.locky will be updated in-place
  ~ resource "github_repository" "locky" {
      ~ delete_branch_on_merge = false -> true
        id                     = "locky"
        name                   = "locky"
      ~ visibility             = "private" -> "public"
      ~ vulnerability_alerts   = false -> true
        # (22 unchanged attributes hidden)
    }

  # module.github.github_repository.terraform_jda will be updated in-place
  ~ resource "github_repository" "terraform_jda" {
      ~ delete_branch_on_merge = false -> true
      - description            = "Le discord de la JDA déployable avec terraform" -> null
        id                     = "terraform_jda"
        name                   = "terraform_jda"
      ~ vulnerability_alerts   = false -> true
        # (23 unchanged attributes hidden)
    }

  # module.github.github_team_repository.application_utcbde_utc_mobile will be created
  + resource "github_team_repository" "application_utcbde_utc_mobile" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "utc-mobile"
      + team_id    = "3158184"
    }

  # module.github.github_team_repository.covoitutc_covoitutc will be created
  + resource "github_team_repository" "covoitutc_covoitutc" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "covoitutc"
      + team_id    = "3158193"
    }

  # module.github.github_team_repository.gesasso_gesasso2 will be created
  + resource "github_team_repository" "gesasso_gesasso2" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "gesasso2"
      + team_id    = "3158197"
    }

  # module.github.github_team_repository.locky_locky will be created
  + resource "github_team_repository" "locky_locky" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "locky"
      + team_id    = "3644328"
    }

  # module.github.github_team_repository.payutc_bdecotiz will be created
  + resource "github_team_repository" "payutc_bdecotiz" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "bdecotiz"
      + team_id    = "3158200"
    }

  # module.github.github_team_repository.payutc_jessy will be created
  + resource "github_team_repository" "payutc_jessy" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "jessy"
      + team_id    = "3158200"
    }

  # module.github.github_team_repository.payutc_jessy_api will be created
  + resource "github_team_repository" "payutc_jessy_api" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "jessy-api"
      + team_id    = "3158200"
    }

  # module.github.github_team_repository.payutc_payback will be created
  + resource "github_team_repository" "payutc_payback" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "payback"
      + team_id    = "3158200"
    }

  # module.github.github_team_repository.payutc_paymoi will be created
  + resource "github_team_repository" "payutc_paymoi" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "paymoi"
      + team_id    = "3158200"
    }

  # module.github.github_team_repository.payutc_payutc_mobile will be created
  + resource "github_team_repository" "payutc_payutc_mobile" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "payutc-mobile"
      + team_id    = "3158200"
    }

  # module.github.github_team_repository.payutc_woolly_api will be created
  + resource "github_team_repository" "payutc_woolly_api" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "woolly-api"
      + team_id    = "3158200"
    }

  # module.github.github_team_repository.payutc_woolly_front will be created
  + resource "github_team_repository" "payutc_woolly_front" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "woolly-front"
      + team_id    = "3158200"
    }

  # module.github.github_team_repository.payutc_woolly_ui will be created
  + resource "github_team_repository" "payutc_woolly_ui" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "woolly-ui"
      + team_id    = "3158200"
    }

  # module.github.github_team_repository.planner_planner will be created
  + resource "github_team_repository" "planner_planner" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "planner"
      + team_id    = "3158217"
    }

  # module.github.github_team_repository.portail_portail will be created
  + resource "github_team_repository" "portail_portail" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "portail"
      + team_id    = "3158212"
    }

  # module.github.github_team_repository.portail_portail_old will be created
  + resource "github_team_repository" "portail_portail_old" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "portail-old"
      + team_id    = "3158212"
    }

  # module.github.github_team_repository.portail_utc_mobile will be created
  + resource "github_team_repository" "portail_utc_mobile" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "utc-mobile"
      + team_id    = "3158212"
    }

  # module.github.github_team_repository.woolly_woolly_api will be created
  + resource "github_team_repository" "woolly_woolly_api" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "woolly-api"
      + team_id    = "3158208"
    }

  # module.github.github_team_repository.woolly_woolly_ui will be created
  + resource "github_team_repository" "woolly_woolly_ui" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "woolly-ui"
      + team_id    = "3158208"
    }

  # module.github.module.old_NastuzziSamy.github_team_membership.membership["covoit-utc"] will be destroyed
  - resource "github_team_membership" "membership" {
      - etag     = "W/\"6d29c92c7650fd94edeb3851ef98f30eb9a45d0b47251849428e23f3ffdee555\"" -> null
      - id       = "3158193:NastuzziSamy" -> null
      - role     = "member" -> null
      - team_id  = "3158193" -> null
      - username = "NastuzziSamy" -> null
    }

  # module.github.module.old_NastuzziSamy.github_team_membership.membership["covoit_utc"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "3158193"
      + username = "NastuzziSamy"
    }

  # module.github.module.old_yElSaadany.github_team_membership.membership["covoit-utc"] will be destroyed
  - resource "github_team_membership" "membership" {
      - etag     = "W/\"0cb1c86d651450a5397585790129a87051dd46910ab5abc46266e526d1cd2a53\"" -> null
      - id       = "3158193:yElSaadany" -> null
      - role     = "member" -> null
      - team_id  = "3158193" -> null
      - username = "yElSaadany" -> null
    }

  # module.github.module.old_yElSaadany.github_team_membership.membership["covoit_utc"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "3158193"
      + username = "yElSaadany"
    }

Plan: 23 to add, 2 to change, 2 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

</details>

*Pusher: @cesar-richard, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI`*